ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/USER_CODE/cfg_file/PinCfg/LPC2200PinCfg.h
/****************************************Copyright (c)****************************************************
**                  
**                                      
**                                
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               PinCfg.h
** Latest modified Date:    2010-12-13
** Latest Version:          1.0
** Descriptions:            I/O功能配置文件 
**
**--------------------------------------------------------------------------------------------------------
** Created by:              
** Created date:            2010-12-13
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
*********************************************************************************************************/
#ifndef _LPC2220PINCFG_H_
#define _LPC2220PINCFG_H_

/*********************************************************************************************************
**                                           -------- 引脚功能查询区 -------                            **          
*********************************************************************************************************/

/****************************** -------- P0 ------- *****************************************************/

#define    P0_00_FUNC        P0_00_SEL              
#define    P0_01_FUNC        P0_01_SEL  
#define    P0_02_FUNC        P0_02_SEL              
#define    P0_03_FUNC        P0_03_SEL  
            
#define    P0_04_FUNC        P0_04_SEL
#define    P0_05_FUNC        P0_05_SEL
#define    P0_06_FUNC        P0_06_SEL
#define    P0_07_FUNC        P0_07_SEL             
#define    P0_08_FUNC        P0_08_SEL
#define    P0_09_FUNC        P0_09_SEL
#define    P0_10_FUNC        P0_10_SEL
#define    P0_11_FUNC        P0_11_SEL
#define    P0_12_FUNC        P0_12_SEL
#define    P0_13_FUNC        P0_13_SEL
#define    P0_14_FUNC        P0_14_SEL
#define    P0_15_FUNC        P0_15_SEL
#define    P0_16_FUNC        P0_16_SEL
#define    P0_17_FUNC        P0_17_SEL
#define    P0_18_FUNC        P0_18_SEL
#define    P0_19_FUNC        P0_19_SEL
#define    P0_20_FUNC        P0_20_SEL
#define    P0_21_FUNC        P0_21_SEL              
#define    P0_22_FUNC        P0_22_SEL
#define    P0_23_FUNC        P0_23_SEL
#define    P0_24_FUNC        P0_24_SEL
#define    P0_25_FUNC        P0_25_SEL
#define    P0_26_FUNC        0
#define    P0_27_FUNC        P0_27_SEL
#define    P0_28_FUNC        P0_28_SEL
#define    P0_29_FUNC        P0_29_SEL
#define    P0_30_FUNC        P0_30_SEL
#define    P0_31_FUNC        0

/****************************** -------- P2 ------- *****************************************************/

#define    P2_16_FUNC        P2_16_SEL
#define    P2_17_FUNC        P2_17_SEL
#define    P2_18_FUNC        P2_18_SEL
#define    P2_19_FUNC        P2_19_SEL
#define    P2_20_FUNC        P2_20_SEL
#define    P2_21_FUNC        P2_21_SEL
#define    P2_22_FUNC        P2_22_SEL
#define    P2_23_FUNC        P2_23_SEL
#define    P2_24_FUNC        P2_24_SEL
#define    P2_25_FUNC        P2_25_SEL
#define    P2_26_FUNC        P2_26_SEL
#define    P2_27_FUNC        P2_27_SEL
#define    P2_28_FUNC        P2_28_SEL
#define    P2_29_FUNC        P2_29_SEL
#define    P2_30_FUNC        P2_30_SEL
#define    P2_31_FUNC        P2_31_SEL

/****************************** -------- P3 ------- *****************************************************/
#define     P3_00_FUNC          P3_00_SEL
    /*
     *  by xuwl
     */
#define     P3_23_FUNC          P3_23_SEL 
#define     P3_24_FUNC          P3_24_SEL             
#define     P3_25_FUNC          P3_25_SEL
#define     P3_26_FUNC          P3_26_SEL             
#define     P3_27_FUNC          P3_27_SEL

#define     P3_28_FUNC        P3_28_SEL
#define     P3_29_FUNC        P3_29_SEL

/*********************************************************************************************************
**                                           -------- 引脚功能配置区 -------                            **          
*********************************************************************************************************/


/****************************** -------- P0 ------- *****************************************************/
//P0.00
#define    P0_00_GPIO        0x00                                       /* GPIO                         */
#define    P0_00_TxD0        0x01                                       /* UART0发送输入端              */
#define    P0_00_PWM1        0x02                                       /* 脉宽调制器输出1              */    
//...      Reserved          0x03                                       /* 保留                         */
#define    P0_00_SEL        P0_00_TxD0                                  

//P0.01
#define    P0_01_GPIO        0x00                                       /* GPIO                         */
#define    P0_01_RxD0        0x01                                       /* UART0接收输入端              */
#define    P0_01_PWM3        0x02                                       /* 脉宽调制器输出3              */
#define    P0_01_EINT0       0x03                                       /* 外部中断0输入                */
#define    P0_01_SEL        P0_01_RxD0                                  

//P0.02
#define    P0_02_GPIO        0x00                                       /* GPIO                         */
#define    P0_02_SCL         0x01                                       /* I2C时钟输入/输出             */
#define    P0_02_CAP00       0x02                                       /* 定时器0捕获输入通道0         */
//...      Reserved          0x03
#define    P0_02_SEL        P0_02_SCL

//P0.03
#define    P0_03_GPIO        0x00                                       /* GPIO                         */
#define    P0_03_SDA         0x01                                       /* I2C数据输入/输出             */
#define    P0_03_MAT00       0x02                                       /* 定时器0匹配输入通道0         */
#define    P0_03_EINT1       0x03                                       /* 外部中断1输入                */
#define    P0_03_SEL        P0_03_SDA

//P0.04
#define    P0_04_GPIO        0x00                                       /* GPIO                         */
#define    P0_04_SCK0        0x01                                       /* SPI0的串行时钟               */
#define    P0_04_CAP01       0x02                                       /* 定时器0的捕获通道1           */
//...      Reserved          0x03
#define    P0_04_SEL        P0_04_GPIO

