ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/USER_CODE/cfg_file/PinCfg/LPC2200PinCfg.h
//P0.05
#define    P0_05_GPIO        0x00                                       /* GPIO                         */
#define    P0_05_MISO0       0x01                                       /* SPI0主机输入从机输出端       */
#define    P0_05_MAT01       0x02                                       /* 定时器0的匹配输入通道1       */
//...      Reserved          0x03
#define    P0_05_SEL        P0_05_GPIO

//P0.06
#define    P0_06_GPIO        0x00                                       /* GPIO                         */
#define    P0_06_MOSI0       0x01                                       /* SPI0主机输出从机输入端       */
#define    P0_06_CAP02       0x02                                       /* 定时器0的捕获输入通道2       */
//...      Reserved          0x03
#define    P0_06_SEL        P0_06_GPIO

//P0.07
#define    P0_07_GPIO        0x00                                       /* GPIO                         */
#define    P0_07_SSEL0       0x01                                       /* SPI0从机选择                 */
#define    P0_07_PWM2        0x02                                       /* 脉宽调制器输出2              */
#define    P0_07_EINT2       0x03                                       /* 外部中断2输入                */
#define    P0_07_SEL        P0_07_GPIO                                 

//P0.08
#define    P0_08_GPIO        0x00                                       /* GPIO                         */
#define    P0_08_TXD1        0x01                                       /* UART1发送输入端              */
#define    P0_08_PWM4        0x02                                       /* 脉宽调制器输出4              */
//...      Reserved          0x03
#define    P0_08_SEL        P0_08_TXD1
    
//P0.09
#define    P0_09_GPIO        0x00                                       /* GPIO                         */
#define    P0_09_RXD1        0x01                                       /* UART1接受输入端              */  
#define    P0_09_PWM6        0x02                                       /* 脉宽调制器输出6              */
#define    P0_09_EINT3       0x03                                       /* 外部中断3输入                */
#define    P0_09_SEL        P0_09_RXD1

//P0.10
#define    P0_10_GPIO        0x00                                       /* GPIO                         */
#define    P0_10_RTS1        0x01                                       /* UART1请求发送输出端          */
#define    P0_10_CAP10       0x02                                       /* 定时器1的捕获输入通道0       */
//...      Reserved          0x03
#define    P0_10_SEL        P0_10_GPIO

//P0.11
#define    P0_11_GPIO        0x00                                       /* GPIO                         */
#define    P0_11_CTS1        0x01                                       /* UART1清除发送输入端          */
#define    P0_11_CAP11       0x02                                       /* 定时器1的捕获输入通道1       */
//...      Reserved          0x03
#define    P0_11_SEL        P0_11_GPIO

//P0.12
#define    P0_12_GPIO        0x00                                       /* GPIO                         */
#define    P0_12_DSR1        0x01                                       /* UART1数据设备就绪端          */
#define    P0_12_MAT10       0x02                                       /* 定时器1的匹配输入通道0       */
#define    P0_12_RD4         0x03                                       /* CAN4接收器输入               */
#define    P0_12_SEL        P0_12_RD4

//P0.13
#define    P0_13_GPIO        0x00                                       /* GPIO                         */
#define    P0_13_DTR1        0x01                                       /* UART1数据终端就绪端          */
#define    P0_13_MAT11       0x02                                       /* 定时器1的匹配输入通道1       */
#define    P0_13_TD4         0x03                                       /* CAN4发送器输出               */  
#define    P0_13_SEL        P0_13_TD4

//P0.14
#define    P0_14_GPIO        0x00                                       /* GPIO                         */
#define    P0_14_DCD1        0x01                                       /* UART1数据载波检测输入端      */
#define    P0_14_EINT1       0x02                                       /* 外部中断1输入                */
//...      Reserved          0x03
#define    P0_14_SEL        P0_14_GPIO

//P0.15
#define    P0_15_GPIO        0x00                                       /* GPIO                         */
#define    P0_15_RI1         0x01                                       /* UART1铃响指示输入端          */
#define    P0_15_EINT2       0x02                                       /* 外部中断2输入                */
//...      Reserved          0x03
#define    P0_15_SEL        P0_15_GPIO

//P0.16
#define    P0_16_GPIO        0x00                                       /* GPIO                         */
#define    P0_16_EINT0       0x01                                       /* 外部中断0输入                */
#define    P0_16_MAT02       0x02                                       /* 定时器0的匹配输出通道2       */
#define    P0_16_CAP02       0x03                                       /* 定时器0的捕获输入通道2       */
#define    P0_16_SEL        P0_16_GPIO

//P0.17
#define    P0_17_GPIO        0x00                                       /* GPIO                         */
#define    P0_17_CAP12       0x01                                       /* 定时器1的捕获输入通道2       */
#define    P0_17_SCK1        0x02                                       /* SPI1串行时钟                 */
#define    P0_17_MAT12       0x03                                       /* 定时器1的匹配输出通道2       */
#define    P0_17_SEL        P0_17_SCK1

//P0.18
#define    P0_18_GPIO        0x00                                       /* GPIO                         */
#define    P0_18_CAP13       0x01                                       /* 定时器1的捕获输入通道3       */
#define    P0_18_MISO1       0x02                                       /* SPI主机输入从机输出端        */
#define    P0_18_MAT13       0x03                                       /* 定时器1的匹配输出通道3       */
#define    P0_18_SEL        P0_18_MISO1

//P0.19
#define    P0_19_GPIO        0x00                                       /* GPIO                         */
#define    P0_19_MAT12       0x01                                       /* 定时器1的匹配输出通道2       */
#define    P0_19_MOSI1       0x02                                       /* SPI1主机输出从机输入端       */
#define    P0_19_CAP12       0x03                                       /* 定时器1的捕获输入通道2       */
#define    P0_19_SEL        P0_19_MOSI1

//P0.20
#define    P0_20_GPIO        0x00                                       /* GPIO                         */
#define    P0_20_MAT13       0x01                                       /* 定时器1的匹配输出通道3       */
#define    P0_20_SSEL1       0x02                                       /* SPI1从机选择                 */
#define    P0_20_EINT3       0x03                                       /* 外部中断3输入                */
#define    P0_20_SEL        P0_20_EINT3

//P0.21
#define    P0_21_GPIO        0x00                                       /* GPIO                         */
#define    P0_21_PWM5        0x01                                       /* 脉宽调制器输出5              */
#define    P0_21_RD3         0x02
#define    P0_21_CAP13       0x03                                       /* 定时器1的捕获输入通道3       */
#define    P0_21_SEL        P0_21_RD3                                   

//P0.22
#define    P0_22_GPIO        0x00                                       /* GPIO                         */
#define    P0_22_TD3         0x01
#define    P0_22_CAP00       0x02                                       /* 定时器0捕获输入通道0         */
#define    P0_22_MAT00       0x03                                       /* 定时器0匹配输出通道0         */
#define    P0_22_SEL        P0_22_TD3

//P0.23
#define    P0_23_GPIO        0x00                                       /* GPIO                         */
#define    P0_23_RD2         0x01                                       /* CAN2接收器输入               */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P0_23_SEL        P0_23_RD2

