ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/USER_CODE/cfg_file/PinCfg/LPC2200PinCfg.h
//P0.24
#define    P0_24_GPIO        0x00                                       /* GPIO                         */
#define    P0_24_TD2         0x01                                       /* CAN2发送器输出               */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P0_24_SEL        P0_24_TD2

//P0.25
#define    P0_25_GPIO        0x00                                       /* GPIO                         */
#define    P0_25_RD1         0x01                                       /* CAN1接收器输入               */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P0_25_SEL        P0_25_RD1

//P0.26
//...      Reserved          0x00
//...      Reserved          0x01
//...      Reserved          0x02
//...      Reserved          0x03
#define    P0_26_SEL        0

//P0.27
#define    P0_27_GPIO        0x00                                       /* GPIO                         */
#define    P0_27_AIN0        0x01                                       /* A/D转换器输入0               */
#define    P0_27_CAP01       0x02                                       /* 定时器0的捕获输入通道1       */
#define    P0_27_MAT01       0x03                                       /* 定时器0的匹配输出通道1       */  
#define    P0_27_SEL        P0_27_AIN0

//P0.28
#define    P0_28_GPIO        0x00                                       /* GPIO                         */
#define    P0_28_AIN1        0x01                                       /* A/D转换器输入1               */
#define    P0_28_CAP02       0x02                                       /* 定时器0的捕获输入通道2       */
#define    P0_28_MAT02       0x03                                       /* 定时器0的匹配输出通道2       */  
#define    P0_28_SEL        P0_28_AIN1

//P0.29
#define    P0_29_GPIO        0x00                                       /* GPIO                         */
#define    P0_29_AIN2        0x01                                       /* A/D转换器输入2               */
#define    P0_29_CAP03       0x02                                       /* 定时器0的捕获输入通道3       */
#define    P0_29_MAT03       0x03                                       /* 定时器0的匹配输出通道3       */
#define    P0_29_SEL        P0_29_AIN2

//P0.30
#define    P0_30_GPIO        0x00                                       /* GPIO                         */
#define    P0_30_AIN3        0x01                                       /* A/D转换器输入3               */
#define    P0_30_EINT3       0x02                                       /* 外部中断3输入                */
#define    P0_30_CAP00       0x03                                       /* 定时器0的捕获输入通道0       */
#define    P0_30_SEL        P0_30_AIN3

//P0.31保留
//...      Reserved          0x00
//...      Reserved          0x01
//...      Reserved          0x02                 
//...      Reserved          0x03
#define    P0_31_SEL        0

/****************************** -------- P2 ------- *****************************************************/

//P2.16
#define    P2_16_GPIO        0x00                                       /* GPIO                         */
#define    P2_16_D16         0x01                                       /* 外部存储器数据线16           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_16_SEL        P2_16_GPIO

//P2.17
#define    P2_17_GPIO        0x00                                       /* GPIO                         */
#define    P2_17_D17         0x01                                       /* 外部存储器数据线17           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_17_SEL        P2_17_GPIO

//P2.18
#define    P2_18_GPIO        0x00                                       /* GPIO                         */
#define    P2_18_D18         0x01                                       /* 外部存储器数据线18           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_18_SEL        P2_18_GPIO

//P2.19
#define    P2_19_GPIO        0x00                                       /* GPIO                         */
#define    P2_19_D19         0x01                                       /* 外部存储器数据线19           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_19_SEL        P2_19_GPIO

//P2.20
#define    P2_20_GPIO        0x00                                       /* GPIO                         */
#define    P2_20_D20         0x01                                       /* 外部存储器数据线20           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_20_SEL        P2_20_GPIO

//P2.21
#define    P2_21_GPIO        0x00                                       /* GPIO                         */
#define    P2_21_D21         0x01                                       /* 外部存储器数据线21           */
//...      Reserved          0x02                                       /* 保留
//...      Reserved          0x03
#define    P2_21_SEL        P2_21_GPIO

//P2.22
#define    P2_22_GPIO        0x00                                       /* GPIO                         */
#define    P2_22_D22         0x01                                       /* 外部存储器数据线22           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_22_SEL        P2_22_GPIO

//P2.23
#define    P2_23_GPIO        0x00                                       /* GPIO                         */
#define    P2_23_D23         0x01                                       /* 外部存储器数据线23           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_23_SEL        P2_23_GPIO

//P2.24
#define    P2_24_GPIO        0x00                                       /* GPIO                         */
#define    P2_24_D24         0x01                                       /* 外部存储器数据线24           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_24_SEL        P2_24_GPIO

//P2.25
#define    P2_25_GPIO        0x00                                       /* GPIO                         */
#define    P2_25_D25         0x01                                       /* 外部存储器数据线25           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_25_SEL        P2_25_GPIO

//P2.26
#define    P2_26_GPIO        0x00                                       /* GPIO                         */
#define    P2_26_D26         0x01                                       /* 外部存储器数据线26           */
#define    P2_26_BOOT0       0x02                                       /* BOOT0                        */
//...      Reserved          0x03
#define    P2_26_SEL        P2_26_BOOT0

//P2.27
#define    P2_27_GPIO        0x00                                       /* GPIO                         */
#define    P2_27_D27         0x01                                       /* 外部存储器数据线27           */
#define    P2_27_BOOT1       0x02                                       /* BOOT1                        */
//...      Reserved          0x03
#define    P2_27_SEL        P2_27_BOOT1

