ringsp/Trans_uCOS_Lib_Keil_Std_Hmi/USER_CODE/cfg_file/PinCfg/LPC2200PinCfg.h
//P2.28
#define    P2_28_GPIO        0x00                                       /* GPIO                         */
#define    P2_28_D28         0x01                                       /* 外部存储器数据线28           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_28_SEL        P2_28_GPIO


//P2.29
#define    P2_29_GPIO        0x00                                       /* GPIO                         */
#define    P2_29_D29         0x01                                       /* 外部存储器数据线29           */
//...      Reserved          0x02                                       /* 保留                         */
//...      Reserved          0x03
#define    P2_29_SEL        P2_29_GPIO

//P2.30
#define    P2_30_GPIO        0x00                                       /* GPIO                         */
#define    P2_30_D30         0x01                                       /* 外部存储器数据线30           */
#define    P2_30_AIN4        0x02                                       /* A/D转换器输入4               */
//...      Reserved          0x03
#define    P2_30_SEL        P2_30_GPIO

//P2.31
#define    P2_31_GPIO        0x00                                       /* GPIO                         */
#define    P2_31_D31         0x01                                       /* 外部存储器数据线31           */
#define    P2_31_AIN5        0x02                                       /* A/D转换器输入5               */
//...      Reserved          0x03
#define    P2_31_SEL        P2_31_GPIO

/****************************** -------- P3 ------- *****************************************************/
//P3.00
#define    P3_00_GPIO        0x00                                       /* GPIO                         */
#define    P3_00_A0          0x01                                       /* 字节定位选择信号,低有效      */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P3_00_SEL        P3_00_A0


//P3.23
#define    P3_23_GPIO        0x00                                       /* GPIO                         */
#define    P3_23_XCLK        0x01                                       /* 字节定位选择信号,低有效      */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P3_23_SEL        P3_23_GPIO


//P3.24
#define    P3_24_GPIO        0x00                                       /* GPIO                         */
#define    P3_24_CS3         0x01                                       /* 字节定位选择信号,低有效      */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P3_24_SEL        P3_24_CS3


//P3.25
#define    P3_25_GPIO        0x00                                       /* GPIO                         */
#define    P3_25_CS2         0x01                                       /* 字节定位选择信号,低有效      */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P3_25_SEL        P3_25_CS2

//P3.26
#define    P3_26_GPIO        0x00                                       /* GPIO                         */
#define    P3_26_CS1         0x01                                       /* 字节定位选择信号,低有效      */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P3_26_SEL        P3_26_CS1


//P3.27
#define    P3_27_GPIO        0x00                                       /* GPIO                         */
#define    P3_27_WE          0x01                                       /* 字节定位选择信号,低有效      */
//...      Reserved          0x02
//...      Reserved          0x03
#define    P3_27_SEL        P3_27_WE

//P3.28
#define    P3_28_GPIO        0x00                                       /* GPIO                         */
#define    P3_28_BLS3        0x01                                       /* 字节定位选择信号,低有效      */
#define    P3_28_AIN7        0x02                                       /* A/D转换器输入7               */
//...      Reserved          0x03
#define    P3_28_SEL        P3_28_GPIO

//P3.29
#define    P3_29_GPIO        0x00                                       /* GPIO                         */
#define    P3_29_BLS2        0x01                                       /* 字节定位选择信号,低有效      */
#define    P3_29_AIN6        0x02                                       /* A/D转换器输入6               */
//...      Reserved          0x03
#define    P3_29_SEL        P3_29_AIN6

/*********************************************************************************************************
** Function name:           pinInit
** Descriptions:            I/O功能初始化
** input parameters:        none
** output parameters:       none
** Returned value:          none
*********************************************************************************************************/
extern void pinInit(void);

#endif

/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
